//#include <stdio.h>
//
///** 논리연산자 **/
//
//int main() {
//	// 두 변수 값 바꾸기 temp
//	// 짝수, 홀수
//
//	int a = 10;
//	int b = 20;
//
//	// a도 10이고, b도 20입니다.
//	// a == 10 그리고, b == 20
//	// a == 10 && b == 20
//	// 논리연산자 : 
//	if (a != 10 || b == 20) {
//		//printf("여기를 출력해주세요.");
//	}	
//
//	int x = 5;
//	int y = 4;
//	int z = 2;
//
//	// 참이면, 1 , 거짓이면 0
//	printf("%d", (x > y) && (x > z)); // 1
//	printf("%d", (x > y) && (x != z)); // 1
//	printf("%d", (x < y) || (z == 2)); // 1
//	printf("%d", (x % z) != 1); // 0
//
//	return 0;
//}